stressTest/serviceTest.yml
config:
  target: 'http://localhost:4001'
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 60
      arrivalRate: 5
      rampTo: 50
    - duration: 60
      arrivalRate: 50
      rampTo: 100
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
scenarios:
  - flow:
    - get:
        url: "/5"
    - get:
        url: "/api/banner/5"
    - get:
        url: "/api/video/5"